hvieir/EK-TM4C1294_IAR8/Projects/drivers/cfaf128x128x16.c
//*****************************************************************************
//
// Copyright (c) 2017 
// Allan Patrick de Souza - <allansouza@alunos.utfpr.edu.br>
// Guilherme Jacichen     - <jacichen@alunos.utfpr.edu.br>
// Jessica Isoton Sampaio - <jessicasampaio@alunos.utfpr.edu.br>
// Mariana Carrião        - <mcarriao@alunos.utfpr.edu.br>
//
// cfaf128x128x16.c - Display driver for the Crystalfontz CFAF128128B-0145T
// display with an ST7735S controller. This version uses an SSI interface.
// This driver was made to be used with the TivaWare grlib library and was based
// on the Kentec320x240x16_ssd2119_spi driver for the ek-tm4c1294xl board, the
// cfal96x64x16 driver for the dk-tm4c123g board and the Energia Screen_HX8353E
// driver for the ek-tm4c1294xl board.
//
// Modified by Hugo Vieira Neto (12. August 2019)
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_ssi.h"
#include "inc/hw_memmap.h"
#include "driverlib/ssi.h"
#include "driverlib/gpio.h"
#include "driverlib/sysctl.h"
#include "driverlib/pin_map.h"  // PART_TM4C1294NCPDT
#include "grlib/grlib.h"
#include "system_TM4C1294.h"

#define DISPLAY_WIDTH  128
#define DISPLAY_HEIGHT 128

// ST7735 LCD controller Command Set
#define CM_NOP             0x00
#define CM_SWRESET         0x01
#define CM_RDDID           0x04
#define CM_RDDST           0x09
#define CM_SLPIN           0x10
#define CM_SLPOUT          0x11
#define CM_PTLON           0x12
#define CM_NORON           0x13
#define CM_INVOFF          0x20
#define CM_INVON           0x21
#define CM_GAMSET          0x26
#define CM_DISPOFF         0x28
#define CM_DISPON          0x29
#define CM_CASET           0x2A
#define CM_RASET           0x2B
#define CM_RAMWR           0x2C
#define CM_RGBSET          0x2D
#define CM_RAMRD           0x2E
#define CM_PTLAR           0x30
#define CM_MADCTL          0x36
#define CM_COLMOD          0x3A
#define CM_SETPWCTR        0xB1
#define CM_SETDISPL        0xB2
#define CM_FRMCTR3         0xB3
#define CM_SETCYC          0xB4
#define CM_SETBGP          0xb5
#define CM_SETVCOM         0xB6
#define CM_SETSTBA         0xC0
#define CM_SETID           0xC3
#define CM_GETHID          0xd0
#define CM_SETGAMMA        0xE0
#define CM_MADCTL_MY       0x80
#define CM_MADCTL_MX       0x40
#define CM_MADCTL_MV       0x20
#define CM_MADCTL_ML       0x10
#define CM_MADCTL_RGB      0x08
#define CM_MADCTL_MH       0x04

// Abstraction for delay calls
#define delay(d) SysCtlDelay(d * 10)

//*****************************************************************************
//
// Defines the SSI and GPIO peripherals that are used for the display.
//
//*****************************************************************************
#define DISPLAY_SSI_PERIPH          SYSCTL_PERIPH_SSI2
#define DISPLAY_SSI_GPIO_PERIPH     SYSCTL_PERIPH_GPIOD
#define DISPLAY_RST_GPIO_PERIPH     SYSCTL_PERIPH_GPIOH
#define DISPLAY_C_D_GPIO_PERIPH     SYSCTL_PERIPH_GPIOL
#define DISPLAY_CS_GPIO_PERIPH      SYSCTL_PERIPH_GPION

//*****************************************************************************
//
// Defines the GPIO pin configurations for the pins that are used for the SSI
// function.
//
//*****************************************************************************
#define DISPLAY_PINCFG_SSICLK     GPIO_PD3_SSI2CLK
#define DISPLAY_PINCFG_SSIFSS     GPIO_PD2_SSI2FSS
#define DISPLAY_PINCFG_SSITX      GPIO_PD1_SSI2XDAT0
#define DISPLAY_PINCFG_SSIRX      GPIO_PD0_SSI2XDAT1

//*****************************************************************************
//
// Defines the port and pins for the SSI peripheral.
//
//*****************************************************************************
#define DISPLAY_SSI_PORT          GPIO_PORTD_BASE
#define DISPLAY_SSI_PIN_CLK       GPIO_PIN_3
#define DISPLAY_SSI_PIN_FSS       GPIO_PIN_2
#define DISPLAY_SSI_PIN_TX        GPIO_PIN_1
#define DISPLAY_SSI_PIN_RX        GPIO_PIN_0
#define DISPLAY_SSI_PINS         (DISPLAY_SSI_PIN_CLK | DISPLAY_SSI_PIN_FSS |  \
                                  DISPLAY_SSI_PIN_TX | DISPLAY_SSI_PIN_RX)

//*****************************************************************************
//
// Defines the port and pins for the display reset (RST) signal.
//
//*****************************************************************************
#define DISPLAY_RST_PORT          GPIO_PORTH_BASE
#define DISPLAY_RST_PIN           GPIO_PIN_3

//*****************************************************************************
//
// Defines the port and pins for the display Data/Command (D/C) signal.
//
//*****************************************************************************
#define DISPLAY_D_C_PORT          GPIO_PORTL_BASE
#define DISPLAY_D_C_PIN	          GPIO_PIN_3

//*****************************************************************************
//
// Defines the port and pins for the display chip select (CS) signal.
//
//*****************************************************************************
#define DISPLAY_CS_PORT           GPIO_PORTN_BASE
#define DISPLAY_CS_PIN	          GPIO_PIN_2

//*****************************************************************************
//
// Defines the SSI peripheral used and the data speed.
//
//*****************************************************************************
#define DISPLAY_SSI_BASE          SSI2_BASE
#define DISPLAY_SSI_CLOCK        (SystemCoreClock / 2)

//*****************************************************************************
//
// Translates a 24-bit RGB color to a display driver-specific color.
//
// \param c is the 24-bit RGB color.  The least-significant byte is the blue
// channel, the next byte is the green channel, and the third byte is the red
// channel.
//
// This macro translates a 24-bit RGB color into a value that can be written
// into the display's frame buffer in order to reproduce that color, or the
// closest possible approximation of that color.
//
// \return Returns the display-driver specific color.
//
// 24-bit format: XXXX XXXX RRRR RRRR GGGG GGGG BBBB BBBB
// 18-bit format: ---- ---- ---- XXRR RRRR GGGG GGBB BBBB
// 16-bit format: ---- ---- ---- ---- RRRR RGGG GGGB BBBB
//  8-bit format: ---- ---- ---- ---- ---- ---- RRRG GGBB
//
//*****************************************************************************
#define DPYCOLORTRANSLATE18(c)   ((((c) & 0x00fc0000) >> 6) |                  \
                                  (((c) & 0x0000fc00) >> 4) |                  \
                                  (((c) & 0x000000fc) >> 2))
#define DPYCOLORTRANSLATE16(c)   ((((c) & 0x00f80000) >> 8) |                  \
                                  (((c) & 0x0000fc00) >> 5) |                  \
                                  (((c) & 0x000000f8) >> 3))
#define DPYCOLORTRANSLATE8(c)    ((((c) & 0x00e00000) >> 16) |                 \
                                  (((c) & 0x0000e000) >> 11) |                 \
                                  (((c) & 0x000000c0) >> 6))
#define DPYCOLORTRANSLATE DPYCOLORTRANSLATE16

