hvieir/EK-TM4C1294_IAR8/Projects/drivers/cfaf128x128x16.c
// Colors
const uint16_t blackColor    = 0x0000;
const uint16_t whiteColor    = 0xFFFF;
const uint16_t redColor      = 0xF800;
const uint16_t greenColor    = 0x07E0;
const uint16_t blueColor     = 0x001F;
const uint16_t yellowColor   = 0xFFE0;
const uint16_t cyanColor     = 0x07FF;
const uint16_t orangeColor   = 0xFBE0;
const uint16_t magentaColor  = 0xF80F;
const uint16_t violetColor   = 0xF81F;
const uint16_t grayColor     = 0x7BEF;
const uint16_t darkGrayColor = 0x39E7;

static uint8_t _orientation = 0;

// Swap contents of 2 uint16 variables
static void 
swap_ui16(uint16_t* a, uint16_t* b){
  uint16_t aux = *a;
  *a = *b;
  *b = aux;
} // swap_ui16

// Swap contents of 2 uint32 variables
static void 
swap_i32(int32_t* a, int32_t* b){
  int32_t aux = *a;
  *a = *b;
  *b = aux;
} // swap_i32

// Transfer data by the configured SSI (send and receive)
static uint8_t 
cfaf128x128x16SsiTransfer(uint8_t command8){
  uint32_t received32;
  SSIDataPut(DISPLAY_SSI_BASE, command8);
  while(SSIBusy(DISPLAY_SSI_BASE));
  SSIDataGet(DISPLAY_SSI_BASE, &received32);
  return (uint8_t)received32;
} // cfaf128x128x16SsiTransfer

//*****************************************************************************
//
//! Write a set of command bytes to the display controller.
//
//! \param command8 is a command byte.
//!
//! This function provides a way to send command bytes to the display
//! controller. It can be used for single commands. It will wait for any
//! previous operation to finish, and then copy all the command bytes to the
//! controller. It will not return until the last command byte has been
//! written to the SSI FIFO, but data could still be shifting out to the
//! display controller when this function returns.
//!
//! \return None.
//
//*****************************************************************************
static void
cfaf128x128x16WriteCommand(uint8_t command8){		
  GPIOPinWrite(DISPLAY_D_C_PORT, DISPLAY_D_C_PIN, 0);
  GPIOPinWrite(DISPLAY_CS_PORT, DISPLAY_CS_PIN, 0);
  cfaf128x128x16SsiTransfer(command8);
  GPIOPinWrite(DISPLAY_CS_PORT, DISPLAY_CS_PIN, DISPLAY_CS_PIN);
} // cfaf128x128x16WriteCommand

//*****************************************************************************
//
//! Write a set of data bytes to the display controller.
//
//! \param data8 is a pointer to a set of data bytes, containing pixel data.
//! \param ndata is the count of command bytes.
//!
//! This function provides a way to send a set of pixel data to the display.
//! The data will draw pixels according to whatever the most recent col, row
//! settings are for the display. It will wait for any previous operation to
//! finish, and then copy all the data bytes to the controller.  It will
//! not return until the last data byte has been written to the SSI FIFO,
//! but data could still be shifting out to the display controller when this
//! function returns.
//!
//! \return None.
//
//*****************************************************************************
static void
cfaf128x128x16WriteData(const uint8_t *data8, uint32_t ndata){		
  GPIOPinWrite(DISPLAY_D_C_PORT, DISPLAY_D_C_PIN, DISPLAY_D_C_PIN);
  GPIOPinWrite(DISPLAY_CS_PORT, DISPLAY_CS_PIN, 0);
  for(;ndata--;data8++)
    cfaf128x128x16SsiTransfer(*data8);
  GPIOPinWrite(DISPLAY_CS_PORT, DISPLAY_CS_PIN, DISPLAY_CS_PIN);
} // cfaf128x128x16WriteData

// Writes one command byte and one data byte.
static void 
cfaf128x128x16WriteRegister(uint8_t command8, uint8_t data8){
  cfaf128x128x16WriteCommand(command8);
  cfaf128x128x16WriteData(&data8, 1);
} // cfaf128x128x16WriteRegister

// Sets up the drawing window. Data sent to the display will fill the pixels of 
// the starting coordinate acording to the orientation set.
static void 
cfaf128x128x16SetWindow(uint16_t x0, uint16_t x1, uint16_t y0, uint16_t y1){
  uint8_t bytes16[2];
  
  switch (_orientation) {
    case 0:
      x0 += 2;
      y0 += 3;
      x1 += 2;
      y1 += 3;
      break;
    case 1:
      x0 += 3;
      y0 += 2;
      x1 += 3;
      y1 += 2;
      break;
    case 2:
      x0 += 2;
      y0 += 1;
      x1 += 2;
      y1 += 1;
      break;
    case 3:
      x0 += 1;
      y0 += 2;
      x1 += 1;
      y1 += 2;
      break;
    default:
      break;
  } // switch

  // Sets up columns.
  cfaf128x128x16WriteCommand(CM_CASET);
  bytes16[0] = (x0&0xFF00)>>8;
  bytes16[1] =  x0&0xFF;
  cfaf128x128x16WriteData(bytes16, 2);
  bytes16[0] = (x1&0xFF00)>>8;
  bytes16[1] =  x1&0xFF;
  cfaf128x128x16WriteData(bytes16, 2);

  // Sets up rows.
  cfaf128x128x16WriteCommand(CM_RASET);
  bytes16[0] = (y0&0xFF00)>>8;
  bytes16[1] =  y0&0xFF;
  cfaf128x128x16WriteData(bytes16, 2);
  bytes16[0] = (y1&0xFF00)>>8;
  bytes16[1] =  y1&0xFF;
  cfaf128x128x16WriteData(bytes16, 2);
  
  // Prepares to write to the display pixel matrix.
  cfaf128x128x16WriteCommand(CM_RAMWR);
} // cfaf128x128x16SetWindow

// Draws a rectangle with the given coordinates and color.
void 
cfaf128x128x16Rect(uint16_t x0, uint16_t x1, uint16_t y0, uint16_t y1,
                   uint32_t color){
  uint32_t t;	
  uint32_t hor_size;
  uint32_t ver_size;
  uint8_t highByte = (0xFF00 & color) >> 8;
  uint8_t lowByte  =  0xFF & color;

  hor_size = x1 - x0 + 1;
  ver_size = y1 - y0 + 1;
          
  cfaf128x128x16SetWindow(x0, x1, y0, y1);
  
  GPIOPinWrite(DISPLAY_D_C_PORT, DISPLAY_D_C_PIN, DISPLAY_D_C_PIN);
  GPIOPinWrite(DISPLAY_CS_PORT, DISPLAY_CS_PIN, 0);
  for(t = (uint32_t)hor_size * ver_size; t > 0; t--){
    cfaf128x128x16SsiTransfer(highByte);
    cfaf128x128x16SsiTransfer(lowByte);
  } // for
  GPIOPinWrite(DISPLAY_CS_PORT, DISPLAY_CS_PIN, DISPLAY_CS_PIN);
} // cfaf128x128x16Rect

//Draws a vertical line with the given coordinates, thickness and color
void 
cfaf128x128x16LineVer(uint16_t x, uint16_t y0, uint16_t y1, uint16_t thickness,
                      uint32_t color){
  cfaf128x128x16Rect(x, x + thickness, y0, y1, color);
} // cfaf128x128x16LineVer

//Draws a horizontal line with the given coordinates, thickness and color
void 
cfaf128x128x16LineHor(uint16_t x0, uint16_t x1, uint16_t y, uint16_t thickness,
                      uint32_t color){
  cfaf128x128x16Rect(x0, x1, y, y + thickness, color);
} // cfaf128x128x16LineHor

//Draws a dot with the given coordinates, thickness and color.
void
cfaf128x128x16Dot(uint16_t x, uint16_t y, uint16_t thickness, uint32_t color){
  cfaf128x128x16Rect(x, x + thickness, y, y + thickness, color);
} // cfaf128x128x16Dot

//*****************************************************************************
//
//! Draws a pixel on the screen.
//!
//! \param pvDisplayData is a pointer to the driver-specific data for this
//! display driver.
//! \param i32X is the X coordinate of the pixel.
//! \param i32Y is the Y coordinate of the pixel.
//! \param ui32Value is the color of the pixel.
//!
//! This function sets the given pixel to a particular color.  The coordinates
//! of the pixel are assumed to be within the extents of the display.
//!
//! \return None.
//
//*****************************************************************************
static void
cfaf128x128x16PixelDraw(void *pvDisplayData, int32_t i32X, int32_t i32Y,
                        uint32_t ui32Value){
  cfaf128x128x16Dot(i32X, i32Y, 0, ui32Value);
} // cfaf128x128x16PixelDraw

//*****************************************************************************
//
//! Draws a horizontal sequence of pixels on the screen.
//!
//! \param pvDisplayData is a pointer to the driver-specific data for this
//! display driver.
//! \param i32X is the X coordinate of the first pixel.
//! \param i32Y is the Y coordinate of the first pixel.
//! \param i32X0 is sub-pixel offset within the pixel data, which is valid for 1
//! or 4 bit per pixel formats.
//! \param i32Count is the number of pixels to draw.
//! \param i32BPP is the number of bits per pixel; must be 1, 4, or 8 optionally
//! ORed with various flags unused by this driver.
//! \param pui8Data is a pointer to the pixel data.  For 1 and 4 bit per pixel
//! formats, the most significant bit(s) represent the left-most pixel.
//! \param pui8Palette is a pointer to the palette used to draw the pixels.
//!
//! This function draws a horizontal sequence of pixels on the screen, using
//! the supplied palette.  For 1 bit per pixel format, the palette contains
//! pre-translated colors; for 4 and 8 bit per pixel formats, the palette
//! contains 24-bit RGB values that must be translated before being written to
//! the display.
//!
//! \return None.
//
//*****************************************************************************
static void
cfaf128x128x16PixelDrawMultiple(void *pvDisplayData, int32_t i32X, int32_t i32Y,
                                int32_t i32X0, int32_t i32Count, int32_t i32BPP,
                                const uint8_t *pui8Data,
                                const uint8_t *pui8Palette){
  uint8_t	lowByte, highByte;
  uint32_t ui32Byte, color;
  cfaf128x128x16SetWindow(i32X, i32X + i32Count, i32Y, i32Y);

