hvieir/EK-TM4C1294_IAR8/Projects/drivers/cfaf128x128x16.c
  GPIOPinWrite(DISPLAY_D_C_PORT, DISPLAY_D_C_PIN, DISPLAY_D_C_PIN);
  GPIOPinWrite(DISPLAY_CS_PORT, DISPLAY_CS_PIN, 0);
  
  // Determinea how to interpret the pixel data based on the number of bits
  // per pixel.
  switch(i32BPP & ~GRLIB_DRIVER_FLAG_NEW_IMAGE){
    // The pixel data is in 1 bit per pixel format.
    case 1:
      // Loop while there are more pixels to draw.
      while(i32Count){
        ui32Byte = *pui8Data++;
        // Loop through the pixels in this byte of image data.
        for(; (i32X0 < 8) && i32Count; i32X0++, i32Count--){
          // Get the next byte of image data.
          color = ((uint32_t *)pui8Palette)[(ui32Byte >> (7 - i32X0)) & 1];
          // Draw this pixel in the appropriate color.
          highByte = (0xFF00 & color) >> 8;
          lowByte  =  0xFF & color;
          cfaf128x128x16SsiTransfer(highByte);
          cfaf128x128x16SsiTransfer(lowByte);
        } // for
        // Start at the beginning of the next byte of image data.
        i32X0 = 0;
      } // while
      // The image data has been drawn.
      break;
    // The pixel data is in 4 bit per pixel format.
    case 4:
      // Loop while there are more pixels to draw. "Duff's device" is
      // used to jump into the middle of the loop if the first nibble of
      // the pixel data should not be used. Duff's device makes use of
      // the fact that a case statement is legal anywhere within a
      // sub-block of a switch statement.  See
      // http://en.wikipedia.org/wiki/Duff's_device for detailed
      // information about Duff's device.
      switch(i32X0 & 1){
        case 0:
          while(i32Count){
            // Get the upper nibble of the next byte of pixel data
            // and extract the corresponding entry from the
            // palette.
            ui32Byte = (*pui8Data >> 4) * 3;
            ui32Byte = (*(uint32_t *)(pui8Palette + ui32Byte) &
                                                    0x00ffffff);
            // Translate this palette entry and write it to the
            // screen.
            color = DPYCOLORTRANSLATE(ui32Byte);
            highByte = (0xFF00 & color) >> 8;
            lowByte  =  0xFF & color;
            cfaf128x128x16SsiTransfer(highByte);
            cfaf128x128x16SsiTransfer(lowByte);
            // Decrement the count of pixels to draw.
            i32Count--;
            // See if there is another pixel to draw.
            if(i32Count){
        case 1:
              // Get the lower nibble of the next byte of pixel
              // data and extract the corresponding entry from
              // the palette.
              ui32Byte = (*pui8Data++ & 15) * 3;
              ui32Byte = (*(uint32_t *)(pui8Palette + ui32Byte) &
                                              0x00ffffff);
              // Translate this palette entry and write it to the
              // screen.
              color = DPYCOLORTRANSLATE(ui32Byte);
              highByte = (0xFF00 & color) >> 8;
              lowByte  =  0xFF & color;
              cfaf128x128x16SsiTransfer(highByte);
              cfaf128x128x16SsiTransfer(lowByte);
              // Decrement the count of pixels to draw.
              i32Count--;
            } // if
          } // while
      } // switch
      // The image data has been drawn.
      break;
    // The pixel data is in 8 bit per pixel format.
    case 8:
      while(i32Count--){
        // Get the next byte of pixel data and extract the
        // corresponding entry from the palette.				
        ui32Byte = *pui8Data++ * 3;
        ui32Byte = *(uint32_t *)(pui8Palette + ui32Byte) & 0x00ffffff;
        // Translate this palette entry and write it to the screen.
        color = DPYCOLORTRANSLATE(ui32Byte);
        highByte = (0xFF00 & color) >> 8;
        lowByte  =  0xFF & color;
        cfaf128x128x16SsiTransfer(highByte);
        cfaf128x128x16SsiTransfer(lowByte);
      } // while
      // The image data has been drawn.
      break;
    // We are being passed data in the display's native format.  Merely
    // write it directly to the display.  This is a special case which is
    // not used by the graphics library but which is helpful to
    // applications which may want to handle, for example, JPEG images.
    case 16:
      // Loop while there are more pixels to draw.
      while(i32Count--){
        // Get the next byte of pixel data and extract the
        // corresponding entry from the palette.
        ui32Byte = *((uint16_t*) pui8Data);
        pui8Data += 2;
        // Translate this palette entry and write it to the screen.
        highByte = (0xFF00 & ui32Byte) >> 8;
        lowByte  =  0xFF & ui32Byte;
        cfaf128x128x16SsiTransfer(highByte);
        cfaf128x128x16SsiTransfer(lowByte);
      } // while
      // The image data has been drawn.
      break;
  } // switch
  GPIOPinWrite(DISPLAY_CS_PORT, DISPLAY_CS_PIN, DISPLAY_CS_PIN);
} // cfaf128x128x16PixelDrawMultiple

//*****************************************************************************
//
//! Draws a horizontal line.
//!
//! \param pvDisplayData is a pointer to the driver-specific data for this
//! display driver.
//! \param i32X1 is the X coordinate of the start of the line.
//! \param i32X2 is the X coordinate of the end of the line.
//! \param i32Y is the Y coordinate of the line.
//! \param ui32Value is the color of the line.
//!
//! This function draws a horizontal line on the display.  The coordinates of
//! the line are assumed to be within the extents of the display.
//!
//! \return None.
//
//*****************************************************************************
static void
cfaf128x128x16LineDrawH(void *pvDisplayData, int32_t i32X1, int32_t i32X2,
                        int32_t i32Y, uint32_t ui32Value){
  if(i32X1 > i32X2)
    swap_i32(&i32X1, &i32X2);
  cfaf128x128x16LineHor(i32X1, i32X2, i32Y, 0, ui32Value);
} // cfaf128x128x16LineDrawH

//*****************************************************************************
//
//! Draws a vertical line.
//!
//! \param pvDisplayData is a pointer to the driver-specific data for this
//! display driver.
//! \param i32X is the X coordinate of the line.
//! \param i32Y1 is the Y coordinate of the start of the line.
//! \param i32Y2 is the Y coordinate of the end of the line.
//! \param ui32Value is the color of the line.
//!
//! This function draws a vertical line on the display.  The coordinates of the
//! line are assumed to be within the extents of the display.
//!
//! \return None.
//
//*****************************************************************************
static void
cfaf128x128x16LineDrawV(void *pvDisplayData, int32_t i32X, int32_t i32Y1,
                        int32_t i32Y2, uint32_t ui32Value){
  if(i32Y1 > i32Y2)
    swap_i32(&i32Y1, &i32Y2);
  cfaf128x128x16LineVer(i32X, i32Y1, i32Y2, 0, ui32Value);
} // cfaf128x128x16LineDrawV

//*****************************************************************************
//
//! Fills a rectangle.
//!
//! \param pvDisplayData is a pointer to the driver-specific data for this
//! display driver.
//! \param pRect is a pointer to the structure describing the rectangle.
//! \param ui32Value is the color of the rectangle.
//!
//! This function fills a rectangle on the display.  The coordinates of the
//! rectangle are assumed to be within the extents of the display, and the
//! rectangle specification is fully inclusive (in other words, both i16XMin and
//! i16XMax are drawn, aint32_t with i16YMin and i16YMax).
//!
//! \return None.
//
//*****************************************************************************
static void
cfaf128x128x16RectFill(void *pvDisplayData, const tRectangle *pRect,
                       uint32_t ui32Value){
  uint16_t x0 = pRect->i16XMin;
  uint16_t x1 = pRect->i16XMax;
  uint16_t y0 = pRect->i16YMin;
  uint16_t y1 = pRect->i16YMax;
  
  if(x0 > x1)
    swap_ui16(&x0, &x1);
  if(y0 > y1)
    swap_ui16(&y0, &y1);
  cfaf128x128x16Rect(x0, x1, y0, y1, ui32Value);
} // cfaf128x128x16RectFill

//*****************************************************************************
//
//! Translates a 24-bit RGB color to a display driver-specific color.
//!
//! \param pvDisplayData is a pointer to the driver-specific data for this
//! display driver.
//! \param ui32Value is the 24-bit RGB color.  The least-significant byte is the
//! blue channel, the next byte is the green channel, and the third byte is the
//! red channel.
//!
//! This function translates a 24-bit RGB color into a value that can be
//! written into the display's frame buffer in order to reproduce that color,
//! or the closest possible approximation of that color.
//!
//! \return Returns the display-driver specific color.
//
//*****************************************************************************
static uint32_t
cfaf128x128x16ColorTranslate(void *pvDisplayData, uint32_t ui32Value){
  // Translate from a 24-bit RGB color to a 3-3-2 RGB color.
  return(DPYCOLORTRANSLATE(ui32Value));
} // cfaf128x128x16ColorTranslate

//*****************************************************************************
//
//! Flushes any cached drawing operations.
//!
//! \param pvDisplayData is a pointer to the driver-specific data for this
//! display driver.
//!
//! This functions flushes any cached drawing operations to the display.  This
//! is useful when a local frame buffer is used for drawing operations, and the
//! flush would copy the local frame buffer to the display.  Since no memory
//! based frame buffer is used for this driver, the flush is a no operation.
//!
//! \return None.
//
//*****************************************************************************
static void
cfaf128x128x16Flush(void *pvDisplayData){
    // There is nothing to be done.
} // cfaf128x128x16Flush

//*****************************************************************************
//
//! The display structure that describes the driver for the Crystalfontz
//! CFAF128128B-0145T panel with ST7735 controller.
//
//*****************************************************************************
const tDisplay g_sCfaf128x128x16 = {
  sizeof(tDisplay),
  0,
  DISPLAY_WIDTH,
  DISPLAY_HEIGHT,
  cfaf128x128x16PixelDraw,
  cfaf128x128x16PixelDrawMultiple,
  cfaf128x128x16LineDrawH,
  cfaf128x128x16LineDrawV,
  cfaf128x128x16RectFill,
  cfaf128x128x16ColorTranslate,
  cfaf128x128x16Flush
};

// Sets the orientation for the rect filling
void 
cfaf128x128x16SetOrientation(uint8_t orientation){
  uint8_t data = 0;
  _orientation = orientation & 0x11;
  
  cfaf128x128x16WriteCommand(CM_MADCTL);
  switch (orientation){
    case 0:
      data = CM_MADCTL_MX | CM_MADCTL_MY | CM_MADCTL_RGB;
      break;
    case 1:
      data = CM_MADCTL_MY | CM_MADCTL_MV | CM_MADCTL_RGB;
      break;
    case 2:
      data = CM_MADCTL_RGB;
      break;
    case 3:
      data = CM_MADCTL_MX | CM_MADCTL_MV | CM_MADCTL_RGB;
      break;
  } // switch
  cfaf128x128x16WriteData(&data, 1);
} // cfaf128x128x16SetOrientation

