hvieir/EK-TM4C1294_IAR8/Projects/drivers/cfaf128x128x16.c
// Clears screen with solid color
void 
cfaf128x128x16ClearColor(uint16_t color){
  uint8_t lastOrientation = _orientation;
  
  cfaf128x128x16SetOrientation(0);
  cfaf128x128x16Rect(0, DISPLAY_WIDTH-1, 0, DISPLAY_HEIGHT-1, color);
  cfaf128x128x16SetOrientation(lastOrientation);
} // cfaf128x128x16ClearColor

// Clears screen with black color
void
cfaf128x128x16Clear(){
  cfaf128x128x16ClearColor(blackColor);
} // cfaf128x128x16Clear

// Initialiazes SSI comunication configuration
void
InitSSICom(void){
  uint32_t initialData = 0;
  
  // Enables the peripherals used by this driver
  SysCtlPeripheralEnable(DISPLAY_SSI_PERIPH);
  SysCtlPeripheralEnable(DISPLAY_SSI_GPIO_PERIPH);

  GPIOPinConfigure(DISPLAY_PINCFG_SSICLK);
  GPIOPinConfigure(DISPLAY_PINCFG_SSIFSS);
  GPIOPinConfigure(DISPLAY_PINCFG_SSITX);
  GPIOPinConfigure(DISPLAY_PINCFG_SSIRX);
  
  GPIOPinTypeSSI(DISPLAY_SSI_PORT, DISPLAY_SSI_PINS);
  
  SSIClockSourceSet(DISPLAY_SSI_BASE, SSI_CLOCK_PIOSC);
  SSIConfigSetExpClk(DISPLAY_SSI_BASE, SystemCoreClock, SSI_FRF_MOTO_MODE_0,
                     SSI_MODE_MASTER, DISPLAY_SSI_CLOCK, 8);

  SSIEnable(DISPLAY_SSI_BASE);
  while(SSIDataGetNonBlocking(DISPLAY_SSI_BASE, &initialData));
} // InitSSICom

//*****************************************************************************
//
//! Initializes the display driver.
//!
//! This function initializes the ST7735S display controller on the panel,
//! preparing it to display data.
//!
//! \return None.
//
//*****************************************************************************
void
cfaf128x128x16Init(void){
  InitSSICom();

  SysCtlPeripheralEnable(DISPLAY_RST_GPIO_PERIPH);
  SysCtlPeripheralEnable(DISPLAY_C_D_GPIO_PERIPH);
  SysCtlPeripheralEnable(DISPLAY_CS_GPIO_PERIPH);
  
  // Configures display control pins as GPIO output
  GPIOPinTypeGPIOOutput(DISPLAY_RST_PORT, DISPLAY_RST_PIN);
  GPIOPinTypeGPIOOutput(DISPLAY_D_C_PORT, DISPLAY_D_C_PIN);
  GPIOPinTypeGPIOOutput(DISPLAY_CS_PORT,  DISPLAY_CS_PIN);
  
  //-----------------
  //Backlight configuration - lacking for now
  //-----------------
  
  //Display reset
  GPIOPinWrite(DISPLAY_RST_PORT, DISPLAY_RST_PIN, DISPLAY_RST_PIN);
  delay(100);	
  GPIOPinWrite(DISPLAY_RST_PORT, DISPLAY_RST_PIN, 0);
  delay(50);
  GPIOPinWrite(DISPLAY_RST_PORT, DISPLAY_RST_PIN, DISPLAY_RST_PIN);
  delay(120);
  
  //Display initialization command set
  cfaf128x128x16WriteCommand(CM_SWRESET);
  delay(150);
  cfaf128x128x16WriteCommand(CM_SLPOUT);
  delay(200);
  cfaf128x128x16WriteRegister(CM_GAMSET, 0x04);
  cfaf128x128x16WriteCommand(CM_SETPWCTR);
  cfaf128x128x16WriteData((const uint8_t*)"\x0A\x14", 2);
  cfaf128x128x16WriteCommand(CM_SETSTBA);
  cfaf128x128x16WriteData((const uint8_t*)"\x0A\x00", 2);
  cfaf128x128x16WriteRegister(CM_COLMOD, 0x05);
  delay(10);
  cfaf128x128x16WriteRegister(CM_MADCTL, CM_MADCTL_RGB);
  cfaf128x128x16WriteCommand(CM_CASET);
  cfaf128x128x16WriteData((const uint8_t*)"\x00\x00\x00\x79", 4);
  cfaf128x128x16WriteCommand(CM_RASET);
  cfaf128x128x16WriteData((const uint8_t*)"\x00\x00\x00\x79", 4);
  cfaf128x128x16WriteCommand(CM_NORON);
  delay(10);
  cfaf128x128x16WriteCommand(CM_DISPON);
  delay(120);
  cfaf128x128x16WriteCommand(CM_RAMWR);
  //Set backlight - if there's any
  cfaf128x128x16SetOrientation(0);
  cfaf128x128x16Clear();
} // cfaf128x128x16Init
